{
  "architectures": [
    "PatchTSMixerForPrediction"
  ],
  "channel_consistent_masking": true,
  "context_length": 512,
  "d_model": 48,
  "distribution_output": "student_t",
  "dropout": 0.5,
  "dtype": "float32",
  "expansion_factor": 3,
  "gated_attn": true,
  "head_aggregation": "max_pool",
  "head_dropout": 0.5,
  "init_std": 0.02,
  "loss": "mse",
  "mask_type": "forecast",
  "mask_value": 0,
  "masked_loss": true,
  "mode": "common_channel",
  "model_type": "patchtsmixer",
  "norm_eps": 1e-05,
  "norm_mlp": "LayerNorm",
  "num_forecast_mask_patches": [
    2
  ],
  "num_input_channels": 4,
  "num_layers": 2,
  "num_parallel_samples": 100,
  "num_patches": 32,
  "num_targets": 3,
  "output_range": null,
  "patch_last": true,
  "patch_length": 16,
  "patch_stride": 16,
  "positional_encoding_type": "sincos",
  "post_init": false,
  "prediction_channel_indices": null,
  "prediction_length": 96,
  "random_mask_ratio": 0.5,
  "scaling": true,
  "self_attn": false,
  "self_attn_heads": 1,
  "transformers_version": "5.12.1",
  "unmasked_channel_indices": null,
  "use_positional_encoding": false
}
